framework_sda/app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows` FROM `data_sda_wilayah`
SELECT COUNT(*) AS `numrows` FROM `data_sda_provinsi`
SELECT *
FROM `wilayah`
SELECT *
FROM `akun`
SELECT *
FROM `data_sda_wilayah`
ORDER BY `id` DESC
SELECT *
FROM `data_sda_provinsi`
ORDER BY `id` DESC
---
    public function index()
    {
        $count_SDA_kab = $this->M_SDAWilayah->countAll();
        $count_SDA_prov = $this->M_SDAProvinsi->countAll();
        $data_kab = $this->M_Wilayah->findAll();
        $data_akun = $this->M_Akun->findAll();
        $data_kat = $this->M_Kategori->findAll();

        $SDA_kab = $this->M_SDAWilayah->orderBy('id', 'DESC')->limit(15)->findAll();
        $SDA_prov = $this->M_SDAProvinsi->orderBy('id', 'DESC')->limit(15)->findAll();

SELECT *
FROM `wilayah`
---
    public function kelola_wilayah()
    {
        $data_kabupaten = $this->M_Wilayah->findAll();

SELECT *
FROM `data_sda_provinsi`
---
    public function sda_provinsi()
    {
        $sda_prov = $this->M_SDAProvinsi->findAll();

SELECT *
FROM `data_sda_provinsi`
WHERE `data_sda_provinsi`.`id` = '2'
---
    public function form_ubah_sda_prov($id)
    {
        $kategori = $this->M_Kategori->findAll();
        $data_SDA = $this->M_SDAProvinsi->find($id);

SELECT *
FROM `wilayah`
SELECT *
FROM `wilayah`
WHERE `wilayah`.`id` = '1'
---
    public function sda_wilayah($id)
    {
        if($id=="pilih"){
            $data_wilayah = $this->M_Wilayah->findAll();
            $data = [
                'title' => "Data SDA Wilayah",
                'data_wilayah' => $data_wilayah,
            ];
            return view('view_admin/sda_wilayah/tabel_sda_wilayah', $data);
        }else{
            $kota = $this->M_Wilayah->find($id);

SELECT *
FROM `data_sda_wilayah`
WHERE `data_sda_wilayah`.`id` = '3'
SELECT *
FROM `wilayah`
WHERE `wilayah`.`id` = '4'
---
    public function form_ubah_sda_wilayah($id)
    {

        $data_SDA = $this->M_SDAWilayah->find($id);

UPDATE `profil_sistem` SET `id` = '1', `nama_sistem` = 'Pusdatin SDA', `logo_sistem` = 'logo_sistem_20240517-103028.jpg', `no_tlp` = '085155557777', `email` = 'admin@gmail.com', `nama_provinsi` = 'Lampung', `logo_provinsi` = 'logo_provinsi.png'
WHERE `profil_sistem`.`id` IN ('1')
---
        }


        $this->M_ProfilSistem->save([
            'id' => "1",
            'nama_sistem' => $this->request->getVar('nama_sistem'),
            'logo_sistem' => $logo_sis_fix,
            'no_tlp' => $this->request->getVar('no_tlp'),
            'email' => $this->request->getVar('email'),
            'nama_provinsi' => $this->request->getVar('nama_provinsi'),
            'logo_provinsi' => $logo_prov_fix,
        ]);

SELECT *
FROM `data_sda_provinsi`
WHERE `data_sda_provinsi`.`id` = '10'
---
    public function ubah_sda_prov($id)
    {
        $dir_geojson    = "uploads/sda_provinsi/geografis/";
        $dir_img        = 'uploads/sda_provinsi/gambar/';
        $dir_doc        = "uploads/sda_provinsi/dokumen/";

        $data = $this->M_SDAProvinsi->find($id);

UPDATE `data_sda_provinsi` SET `id` = '10', `judul_data` = 'Irigasi Kawasan Pesisir', `isi_data` = 'Dokumen irigasi pada kawasan pesisir.', `id_kategori` = '1', `gambar` = 'Gambar_Data_10.png', `dokumen` = 'ID10_Dokumen.xlsx', `tipe_dokumen` = 'upload', `ket_dokumen` = '', `geojson_titik` = 'ID10_Titik.kml', `geojson_garis` = '', `geojson_petak` = 'ID10_Petak_20240627-101003.kml', `diupload_oleh` = 'admin', `tahun` = '2024'
WHERE `data_sda_provinsi`.`id` IN ('10')
---
            $geo_garis->move($dir_geojson, $namaGjsonGaris, true);
        }

        $this->M_SDAProvinsi->save([
            'id' => $ID,
            'judul_data' => $this->request->getVar('judul_data'),
            'isi_data' => $this->request->getVar('isi'),
            'id_kategori' => $this->request->getVar('id_kategori'),
            'gambar' => $namaGambar,
            'dokumen' => $namaDokumen,
            'tipe_dokumen' => $tipe_dokumen,
            'ket_dokumen' => $ket_dokumen,
            'geojson_titik' => $namaGjsonTitik,
            'geojson_garis' => $namaGjsonGaris,
            'geojson_petak' => $namaGjsonPetak,
            'diupload_oleh' => session()->get('username'),
            'tahun' => $this->request->getVar('tahun'),
        ]);

SELECT *
FROM `data_sda_provinsi`
WHERE `data_sda_provinsi`.`id` = '2'
DELETE FROM `data_sda_provinsi`
WHERE `id` IN ('2')
---
    public function hapus_sda_prov($id)
    {
        $dir_geojson    = "uploads/sda_provinsi/geojson/";
        $dir_img        = 'uploads/sda_provinsi/gambar/';
        $dir_doc        = "uploads/sda_provinsi/dokumen/";

        $data = $this->M_SDAProvinsi->find($id);

        $check = realpath($dir_img.$data["gambar"]);
        if (is_file($check)){
            unlink($check); // Hapus
        }
        $check = realpath($dir_doc.$data["dokumen"]);
        if (is_file($check)){
            unlink($check); // Hapus
        }
        $check = realpath($dir_geojson.$data["geojson_petak"]);
        if (is_file($check)){
            unlink($check); // Hapus
        }
        $check = realpath($dir_geojson.$data["geojson_garis"]);
        if (is_file($check)){
            unlink($check); // Hapus
        }
        $check = realpath($dir_geojson.$data["geojson_titik"]);
        if (is_file($check)){
            unlink($check); // Hapus
        }

        $this->M_SDAProvinsi->delete($id);