framework_sda/app/Controllers/Publik.php

SELECT *
FROM `akun`
SELECT *
FROM `wilayah`
ORDER BY `nama` ASC
SELECT *
FROM `wilayah`
SELECT *
FROM `data_sda_wilayah`
SELECT *
FROM `data_sda_provinsi`
---
    public function index()
    {
        $data_akun  = $this->M_Akun->findAll();
        $data_kab   = $this->M_Wilayah->orderBy('nama', 'ASC')->findAll();
        $data_kat   = $this->M_Kategori->findAll();
        $sda_kab    = $this->M_SDAWilayah->findAll();
        $sda_prov   = $this->M_SDAProvinsi->findAll();

SELECT *
FROM `wilayah`
WHERE `wilayah`.`id` = '1'
SELECT *
FROM `data_sda_wilayah`
WHERE `data_sda_wilayah`.`id` = '1'
SELECT *
FROM `wilayah`
WHERE `wilayah`.`id` = '4'
---
    public function data_wilayah($idWilayah)
    {
        if(empty($_GET['layout'])){
            return redirect()->to(base_url('Publik'));
        } else if($_GET['layout'] == "maps"){
            $data_wilayah = $this->M_Wilayah->find($idWilayah);
            $SDA_wilayah = $this->M_SDAWilayah->find($idWilayah);

            $kategori = $this->M_Kategori->select('id as fisrtKat')->first();
            if(!empty($this->request->getVar("kategori"))){
                $kategori = $this->request->getVar("kategori");
            } else {$kategori = $kategori["fisrtKat"];}
            if(!empty($this->request->getVar("tahun"))){
                $tahun = $this->request->getVar("tahun");
            } else {$tahun = date('Y');}

            $data_wilayah = $this->M_Wilayah->find($idWilayah);

SELECT *
FROM `wilayah`
WHERE `wilayah`.`id` = '1'
---

            $starttime = microtime(true);

            $data_wilayah = $this->M_Wilayah->find($idWilayah);